In [1]:
import pandas as pd 
import gc 
import polars as pl

In [2]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', None)

In [3]:
#downcast for less memory usage 
cols_int16={
    'id': 'int16',
    'item_id': 'int16',
    'dept_id': 'int16',
    'cat_id': 'int16',
    'store_id': 'int16',
    'state_id': 'int16',
    'sales': 'int16',
    'wm_yr_wk': 'int16',
    'month': 'int16',
    'year': 'int16',
    'd': 'int16',
    'event_name_1': 'int16',
    'event_type_1': 'int16',
    'event_name_2': 'int16',
    'event_type_2': 'int16',
    'snap_CA': 'int16',
    'snap_TX': 'int16',
    'snap_WI': 'int16',
    'day': 'int16'
    }

In [4]:
df=pd.read_csv('final.csv',dtype=cols_int16)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58327370 entries, 0 to 58327369
Data columns (total 22 columns):
 #   Column        Dtype
---  ------        -----
 0   id            int16
 1   item_id       int16
 2   dept_id       int16
 3   cat_id        int16
 4   store_id      int16
 5   state_id      int16
 6   sales         int16
 7   wm_yr_wk      int16
 8   month         int16
 9   year          int16
 10  d             int16
 11  event_name_1  int16
 12  event_type_1  int16
 13  event_name_2  int16
 14  event_type_2  int16
 15  snap_CA       int16
 16  snap_TX       int16
 17  snap_WI       int16
 18  weekday_cos   float64
 19  weekday_sin   float64
 20  day           int16
 21  sell_price    float64
dtypes: float64(3), int16(19)
memory usage: 3.4 GB

In [6]:
df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,sales,wm_yr_wk,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI,weekday_cos,weekday_sin,day,sell_price
0,14370,1437,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,9.58
1,14380,1438,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,3.97
2,14390,1439,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,2.97
3,14400,1440,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,4.34
4,14410,1441,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,2.98

In [11]:
col_ord=['id','item_id','dept_id','cat_id','store_id','state_id','wm_yr_wk','day','month','year','d','event_name_1','event_type_1','event_name_2','event_type_2','snap_CA','snap_TX','snap_WI','weekday_cos','weekday_sin','sales','sell_price']

In [12]:
df=df[col_ord]

In [13]:
df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,wm_yr_wk,day,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI,weekday_cos,weekday_sin,sales,sell_price
0,14370,1437,3,1,0,0,11101,29,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,0,9.58
1,14380,1438,3,1,0,0,11101,29,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,0,3.97
2,14390,1439,3,1,0,0,11101,29,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,0,2.97
3,14400,1440,3,1,0,0,11101,29,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,0,4.34
4,14410,1441,3,1,0,0,11101,29,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,0,2.98

In [34]:
df.rename(columns={'day_y':'day'},inplace=True)

In [28]:
df[df['day_x']==df['d']].shape

(58327370, 23)

In [36]:
df.drop('day_x',inplace=True,axis=1)

In [6]:
df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,sales,wm_yr_wk,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI,weekday_cos,weekday_sin,day,sell_price
0,14370,1437,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,9.58
1,14380,1438,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,3.97
2,14390,1439,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,2.97
3,14400,1440,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,4.34
4,14410,1441,3,1,0,0,0,11101,1,2011,1,19,2,3,1,0,0,0,-0.222521,-0.974928,29,2.98

In [32]:
#we should fill the empty values in the sell_price column 

df['sell_price']=df.groupby(['item_id','store_id'])['sell_price'].ffill()
df['sell_price']=df.groupby(['item_id','store_id'])['sell_price'].bfill()

In [8]:
df['sell_price'].isna().value_counts()
#all filled

sell_price
False    58327370
Name: count, dtype: int64

In [14]:
#resave the dataset
df.to_csv('final.csv',header=True,index=False)